index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-08 Fri 01:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">


<div id="outline-container-org72010bb" class="outline-2">
<h2 id="org72010bb"><span class="section-number-2">1.</span> Code index</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb9d82ee" class="outline-3">
<h3 id="orgb9d82ee"><span class="section-number-3">1.1.</span> List of files</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="./0.html">List of dxf codes</a>
</p>

<p>
Includes a list of dxf files produced by python library dxf
</p>
</div>
</div>

<div id="outline-container-org62d57ad" class="outline-3">
<h3 id="org62d57ad"><span class="section-number-3">1.2.</span> binomials</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="#org62d57ad">example of binomials</a>
</p>
</div>
</div>

<div id="outline-container-org859fc16" class="outline-3">
<h3 id="org859fc16"><span class="section-number-3">1.3.</span> FEM</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org8ed2150" class="outline-4">
<h4 id="org8ed2150"><span class="section-number-4">1.3.1.</span> Software Installation</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
<a href="./FEM.html">./FEM.html</a>
</p>

<p>
Install finite elements
</p>
</div>
</div>

<div id="outline-container-org3fcffb4" class="outline-4">
<h4 id="org3fcffb4"><span class="section-number-4">1.3.2.</span> FEM pictures</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
<a href="./fem/test.html">./fem/test.html</a>
</p>

<p>
Pictures of fem runs
</p>
</div>
</div>
</div>


<div id="outline-container-orga60b973" class="outline-3">
<h3 id="orga60b973"><span class="section-number-3">1.4.</span> sympy vs maxima</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<a href="./sympy_vs_maxima.html">maxima vs sympy</a>
Code comparing of solving the same problem in maxima and sumpy
</p>
</div>
</div>

<div id="outline-container-orgb1934d7" class="outline-3">
<h3 id="orgb1934d7"><span class="section-number-3">1.5.</span> tank deflection</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<a href="./tank_deflection.html">finite elements method of tank deflection</a>
</p>

<p>
Elmer finite elements method, results
</p>
</div>
</div>

<div id="outline-container-org4d5c546" class="outline-3">
<h3 id="org4d5c546"><span class="section-number-3">1.6.</span> fixing up my motorcycle</h3>
<div class="outline-text-3" id="text-1-6">
<p>
<a href="./motorcycle/drain-bolt.html">change cooling fluid</a>
</p>

<p>
Change engine cooling fluid of Zontes G1 150
</p>
</div>
</div>


<div id="outline-container-org6372e72" class="outline-3">
<h3 id="org6372e72"><span class="section-number-3">1.7.</span> org-mode produce python code, using lisp</h3>
<div class="outline-text-3" id="text-1-7">
<p>
<a href="./test-lisp-src-code-blocks.html">./test-lisp-src-code-blocks.html</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-11-08 Fri 01:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
